performance/jmeter/results/html-load/statistics.json
{
  "03_GetUserApps" : {
    "transaction" : "03_GetUserApps",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 268.1,
    "medianResTime" : 257.0,
    "minResTime" : 230.0,
    "maxResTime" : 333.0,
    "pct1ResTime" : 319.7,
    "pct2ResTime" : 332.34999999999997,
    "pct3ResTime" : 333.0,
    "throughput" : 0.3560302625723187,
    "receivedKBytesPerSec" : 3.06577172340899,
    "sentKBytesPerSec" : 0.3026952603471295
  },
  "04_GetUrlLink" : {
    "transaction" : "04_GetUrlLink",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 147.95000000000002,
    "medianResTime" : 145.5,
    "minResTime" : 134.0,
    "maxResTime" : 192.0,
    "pct1ResTime" : 162.60000000000002,
    "pct2ResTime" : 190.54999999999998,
    "pct3ResTime" : 192.0,
    "throughput" : 0.3513826908886468,
    "receivedKBytesPerSec" : 0.14171977669629995,
    "sentKBytesPerSec" : 0.36124817171193646
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1679,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1234.7093508040527,
    "medianResTime" : 1013.0,
    "minResTime" : 134.0,
    "maxResTime" : 4732.0,
    "pct1ResTime" : 2602.0,
    "pct2ResTime" : 3069.0,
    "pct3ResTime" : 3793.6000000000013,
    "throughput" : 5.638125684197801,
    "receivedKBytesPerSec" : 12.065646549082588,
    "sentKBytesPerSec" : 13.697830835871443
  },
  "02_UserLogin" : {
    "transaction" : "02_UserLogin",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 253.54999999999995,
    "medianResTime" : 245.0,
    "minResTime" : 230.0,
    "maxResTime" : 344.0,
    "pct1ResTime" : 284.20000000000005,
    "pct2ResTime" : 341.04999999999995,
    "pct3ResTime" : 344.0,
    "throughput" : 0.36243045865574547,
    "receivedKBytesPerSec" : 0.1557318377036406,
    "sentKBytesPerSec" : 0.4302799888552634
  },
  "01_CompanyLogin" : {
    "transaction" : "01_CompanyLogin",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 667.65,
    "medianResTime" : 647.0,
    "minResTime" : 617.0,
    "maxResTime" : 1005.0,
    "pct1ResTime" : 711.3000000000001,
    "pct2ResTime" : 990.4499999999998,
    "pct3ResTime" : 1005.0,
    "throughput" : 0.36034737486937407,
    "receivedKBytesPerSec" : 0.26990862941875965,
    "sentKBytesPerSec" : 0.36615375346834345
  },
  "05_SearchItem" : {
    "transaction" : "05_SearchItem",
    "sampleCount" : 1599,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1279.7573483427122,
    "medianResTime" : 1076.0,
    "minResTime" : 305.0,
    "maxResTime" : 4732.0,
    "pct1ResTime" : 2642.0,
    "pct2ResTime" : 3078.0,
    "pct3ResTime" : 3816.0,
    "throughput" : 5.52954276663877,
    "receivedKBytesPerSec" : 11.720337225597738,
    "sentKBytesPerSec" : 13.82385691659693
  }
}